tutorials/multiphase/multiphaseEulerFoam/RAS/LBend/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    basicMultiphaseSystem;

phases (solids gas);

solids
{
    type          purePhaseModel;

    diameterModel constant;

    constantCoeffs
    {
        d               462e-6;
    }

    alphaMax        0.65;
    residualAlpha   1e-5;
}

gas
{
    type          purePhaseModel;

    diameterModel none;

    residualAlpha 1e-5;
}

blending
{
    default
    {
        type            continuous;
        phase           gas;
    }
}

surfaceTension
{
    gas_solids
    {
        type            constant;
        sigma           0;
    }
}

drag
{
    solids_dispersedIn_gas
    {
        type            GidaspowErgunWenYu;
        residualAlpha   1e-5;
        residualRe      1e-5;
    }
}

virtualMass
{
    solids_dispersedIn_gas
    {
        type            constantCoefficient;
        Cvm             0;
    }
}

heatTransfer
{
    solids_dispersedIn_gas
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

interfaceCompression
{}

// ************************************************************************* //
